ntvn2022/Z-Bee-Duo/xiaozhi-ai/may1-controller/sdkconfig.defaults
# [custom] Defaults for the Máy 1 controller (ESP32-S3, 4MB flash is plenty).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000
# esp-mqtt
CONFIG_MQTT_PROTOCOL_311=y
